{
	"44": "昨晚梦见男朋友和别的女人在逛街，梦里我的第一反应是查源代码…结果调试半天查不出来为什么显示的是那个女人不是我，最后含泪把那个女人给注释掉了，再一运行就是我男朋友自己逛街了…醒来囧字脸呆了很久…囧rz",
	"45": "一个合格的程序员是不会写出 诸如 “摧毁地球” 这样的程序的，他们会写一个函数叫 “摧毁行星”而把地球当一个参数传进",
	"46": "如果你的朋友是it民工的，年底吃饭聚餐就不要AA制了，你请他吧，主动买单是不错的选择。千万不要当着他的面提年终奖，出国旅游，买房买车等等。生活不易，需要互相扶持前行。",
	"47": "设计师看了程序实现出的界面内心百感交集，就像把女儿嫁给了小混混，最后生出了一窝小流氓似的。",
	"48": "真正的程序员喜欢兼卖爆米花，他们利用CPU散发出的热量做爆米花，可以根据米花爆裂的速度听出正在运行什么程序。",
	"49": "祝大家在以后的日子里. 男生象Oracle般健壮; 女生象win7般漂亮; 桃花运象IE中毒般频繁; 钱包如Gmail容量般壮大, 升职速度赶上微软打补丁 ， 追女朋友像木马一样猖獗， 生活像重装电脑后一样幸福， 写程序敲代码和聊天一样有激情。",
	"50": "老板说了一个笑话，全办公室哄堂大笑，有抹眼泪的，有捂肚子的，有捶桌子的。只有小猿没笑，我边笑边问他：你怎么不笑呀？他说：我已经辞职了！",
	"51": "程序员最讨厌的四件事：写注释、写文档、别人不写注释、别人不写文档 … ",
	"52": "一个士兵爱上一个公主，公主告诉他，如果他愿意连续100个晚上守在她的阳台下，她就接受他。于是士兵照做了，他等了一天，两天，三天……直到第九十九天，士兵离开了。为什么士兵不再坚持最后一天？答案很凄美——因为那个士兵是程序员，他从0开始数的.",
	"53": "一晚下班回家，一民警迎面巡逻而来。突然对我大喊：站住！　　民警：int类型占几个字节？　　我：4个。　　民警：你可以走了。　　我感到很诧异。　　我：为什么问这样的问题？　　民警：深夜还在街上走，寒酸苦逼的样子，不是小偷就是程序员……　",
	"10": "如果世界让程序员落魄，程序员就让世界沉默",
	"54": "据说在每一个互联网公司里，都有一个扫地的老太太。很偶然地，当她经过一个程序员的身边，扫一眼屏幕上的代码，会低声提醒对方：小心，栈溢出了。",
	"11": "开源客栈日暮，入栈不知归路。debug无尽头，误入代码深处，单步，单步，发现bug无数。",
	"55": "程序猿追求MM不成，含泪追问:我在你眼里算什么？！MM答曰:真人版的windows优化大师……",
	"12": "横眉冷对万行码，俯首甘为码字牛。问君能有几多愁，恰似调完代码改需求。",
	"56": "产品经理有三宝：原型，扯皮，爱吐槽。项目经理有三宝：进度，流程，做报表。团队经理有三宝：团建，开会，评绩效。程序员有三宝：闷骚，加班，修电脑。测试人员有三宝：较真，温柔，撒撒娇。敏捷教练有三宝：看板，迭代，狂布道。SQA有三宝：质疑，挑刺，写报告 ……",
	"13": "bug知时节，上线乃发生。随风潜入夜，404无声。野径云俱黑，孤窗火独明。晓看公司处，一只程序猿。",
	"57": "世界上最尴尬的选择是：你是switch我是default，只有别人都不合适了，才能轮到我。",
	"14": "程xx遭遇车祸成植物人，医生说她活下来的希望只有万分之一，唤醒更为渺茫。她的同事和亲人没放弃，并根据程xx对testing痴迷的作风，每天都在她身边念：“你测的模块上线后回滚了…”奇迹发生了，程xx醒来第一句话：确认那模块是我测的？",
	"58": "“你们用盗版的时候有想过做出这款软件的程序员吗？！他们该如何养家糊口？！”“哈哈哈，别逗了程序员哪有家要养啊。。。”",
	"15": "两个程序员， A：哥们，最近手头紧，能借点钱？ B：成啊，要多少？ A：一千成不？ B：咱俩谁跟谁！给你凑个整，这一千零二十四，拿去吧。",
	"59": "为什么每次圣斗士出招前都要大喊一下招式？” 程序猿回复：“函数要先声明，然后才能调用。”",
	"16": "一个程序员在海滨游泳时溺水身亡。他死前拼命的呼救，当时海滩上有许多救生员，但是没有人救他。因为他一直大喊“F1!”“F1!”，谁都不知道“F1”究竟是什么意思。",
	"17": "1）程序员其实可痛苦的了......需求一做一改，一个月就过去了；嚎~需求再一改一调，一季度就过去了；嚎~ 2）、程序员最痛苦的事儿是啥，知道不？就是，程序没做完，需求又改了；3）、程序员最最痛苦的事儿是啥，知道不？ 就是，系统好不容易做完了，方案全改了； 4）、程序员最最最痛苦的事儿是啥，知道不？ 就是，系统做完了，狗日的客户跑了； 5）、程序员最最最最最痛苦的事儿是啥，知道不？ 就是，狗日的客户又回来了,程序给删没了！",
	"18": "有一天一个程序员见到了上帝.上帝: 小伙子,我可以满足你一个愿望. 程序员: 我希望中国国家队能再次打进世界杯. 上帝: 这个啊!这个不好办啊,你还说下一个吧! 程序员: 那好!我的下一个愿望是每天都能休息6个小时以上. 上帝: 还是让中国国家打进世界杯.",
	"19": "做了几年程序员，厌烦了，想换行了。于是天天猛敲回车键。",
	"1": "老婆给当程序员的老公打电话：下班顺路买十个包子，如果看到卖西瓜的，买一个。当晚老公手捧一个包子进了家门…老婆怒道：你怎么只买一个包子？！老公甚恐，喃喃道：因为我真看到卖西瓜的了。",
	"2": "一程序员去面试，面试官问：‘你毕业才两年，这三年工作经验是怎么来的？！’程序员答：‘加班。’",
	"3": "宝宝数学很好，2岁就可以从1数到10了。后来，我告诉他0比1还小。今天吃饺子，我说：“宝宝，你数数你想吃几个饺子？”“0，1，2，3。”一边说着一边拿起一个饺子，“这是第0个。”老婆怒吼：“下一代还是做程序员的命！”",
	"4": "某程序员对书法十分感兴趣，退休后决定在这方面有所建树。于是花重金购买了上等的文房四宝。 一日，饭后突生雅兴，一番磨墨拟纸，并点上了上好的檀香，颇有王羲之风范，又具颜真卿气势， 定神片刻，泼墨挥毫，郑重地写下一行字：hello world。",
	"5": "问：程序员最讨厌康熙的哪个儿子。答：胤禩。因为他是八阿哥（bug）",
	"6": "程序猿要了3个孩子，分别取名叫Ctrl、Alt 和Delete，如果他们不听话，程序猿就只要同时敲他们一下就会好的…",
	"7": "如果没能一次成功，那就叫它1.0版吧。",
	"8": "今天在公司听到一句惨绝人寰骂人的话：“你TM就是一个没有对象的野指针！”",
	"9": "莫愁前路无知己，总有bug跟着你。",
	"60": "问：上帝真能控制生活中发生的每一个细节吗？　　　答：如果他使用除错程序(Debugger)的话就可以，但一步步跟踪每一个变量肯定是件很烦的事。　　　问：为什么上帝会允许罪恶存在？　　　答：他原来以为在上一个版本中已经去掉所有的罪恶Bug。　　　问：上帝真的无所不能嘛？　　　答：是的，他经常这么想，但也经常被自己昨天干的事吓一跳。　　　问：上帝真的在七天里创建了整个世界吗？　　　答：他在头六天里没日没夜地工作，仅靠可口可乐和糖块过活，第七天等他回到家时发现已经被女朋友抛弃了。　　　问：奇迹时代是如何结束的？　　　答：你说的是计划的开发阶段，现在是维护阶段。　　　问：我死后去哪儿？　　　答：备份磁带。　　　问：有人声称听见了上帝的声音，是真的吗？　　　答：其实他们只是收到了E-mail而已。",
	"61": "“你知道谁是第一个加V的么？”“ctrl 啊”",
	"62": "程序员问禅师：“我和在一起 7年的女友分手了，程序员是否诸多和爱情无缘?”禅师笑而不语，把程序员带到正在比赛的球场。程序员大悟：“大师的意思是否是说：爱情的意义就像一场比赛，只要过程努力过，结果如何并不重要?”大师闭上眼睛道：“你分手关我球事?”",
	"63": "程序员工作：解决找不到对象的问题； 程序员生活：解决找不到对象的问题。",
	"20": "问：一对程序员恋人面对面坐着工作，你猜他们在做什么？答：面向对象编程。",
	"64": "I’ll be there in 5 minutes. If not, read this again. 我5分钟后到，如果没到，请再读一遍此短信……",
	"21": "十年生死两茫茫，写程序，到天亮。 千行代码，Bug何处藏。 纵使上线又怎样，朝令改，夕断肠。 领导每天新想法，天天改，日日忙。 相顾无言，惟有泪千行。 每晚灯火阑珊处，程序员，又加班,工作狂.",
	"65": " 1、警察：不要跑！ 2、国足：必胜！ 3、老师：同学们不要睡了！ 4、病人：医生，您轻点儿！ 5、父母：孩子，不要闹了 ！6、罪犯：我是冤枉啊！7、女人：不要嘛！8、男人：我发誓！9、:程序员：这个不能实现！",
	"22": "世界上最远的距离，是我在if里你在else里，虽然经常一起出现，但却永不结伴执行",
	"66": "客户被绑，蒙眼，惊问：“想干什么？”，对方不语，鞭笞之，客户求饶：“别打，要钱？”，又一鞭，“十万够不？”，又一鞭，“一百万？”，又一鞭。客户崩溃：“你们TMD到底要啥？”“要什么？我帮你做项目，写代码的时候也很想知道你TMD到底想要啥！”",
	"23": "十行代码九个警告八个错误竟然敢说七日精通六天学会五湖四海也不见如此三心二意之项目经理简直一等下流。",
	"67": "好故事里都有冲突，任何棘手的冲突都是递归的。",
	"24": "程序猿：我的第一个问题是，对于我第二个和第三个问题，你可不可以只用‘能’和‘不能’来回答?　　老板：“OK!”　　我的第二个问题是，如果我的第三个问题是我能不能涨工资?那么你对于我的第三个问题的答案能不能和第二个问题的答案一样?　　老板：。。。。。。",
	"68": "天冷了，办公室的门上出现了一张告示，赫然写着，“不关门，有BUG”，然后就见每个出去的程序员，非常虔诚的把门关上了。",
	"25": "《程序员的雨巷》开着MyEclipse，独自彷徨在悠长、悠长又寂寥的雨巷，我希望逢着一个和我一样的调试代码的姑娘。她是有需求一样的凌乱，设计一样的荒唐，测试一样的忧愁， 在代码里哀怨，哀怨又彷徨；她彷徨在这寂寥的雨巷。",
	"69": "一群男程序员酒后乱逛，正要集体侵犯一个女子。女子见势不妙，问：那你们说最好的编程语言是什么？程序员们就地讨论了三天三夜不欢而散，女子趁机顺利脱身。",
	"26": "一女同学在食堂吃饭时，一程序猿凑到旁边，“同学，我能和你说话不，我已经一个月没和女生说话了。",
	"27": "一同学问我，软件外包是什么。解释了几句还没明白，遂想了一下：包工头知道吧？顿悟！",
	"28": "正在码代码ing，医院回来的同事一脸的苦逼样子，问他怎么了？他回答：得了类风湿性关节炎了，我怕会遗传给下一代啊。我一脸的问号：谁说类风湿性关节炎能遗传的？丫一脸诧异：类不是继承的吗？",
	"29": "真的勇士，敢于直面惨淡的warning、敢于正视淋漓的error。",
	"70": "网友A留言：“C确实不适合做应用层，C有C的地盘。” 网友B回复：“就是传说中的C盘么。”当时我就笑喷了……",
	"71": "早年，某公司，买了一台电脑，放在某人的办公桌上。有一天这个人被领导郊区谈话，领导说：这个电脑呢，是放在你的桌子上，主要是你在用，但是它并不是你的个人财产，你在电脑上写我的电脑，影响很不好。于是，我的电脑被重命名为我们的电脑。",
	"72": "去IT公司面试应该穿得不修边幅一点，头发蓬乱一点，眼圈描黑一点，神情装得憔悴一点，至少看上去要像个程序员……",
	"73": "一姑娘在声讨她土木工程的前男友。她闺密帮腔说：土木工程嘛，又土又木…………那软件工程的童鞋们情何以堪。",
	"30": "某小偷潜入某IT公司欲行窃，没想到始终有人，他只好等啊等啊等，结果始终有一大拨人在加班。过了一个月，小偷终于逮到机会溜出来，同伙问：去哪了？小偷：在IT公司呆了一个月。同伙：收获不错吧？小偷苦笑：别TM提了，三十个大夜下来，我现在已经学会写程序了。",
	"74": "如果你的朋友最近没和你联系，要理解！只有三种可能：第一，他死了；第二，他改行当程序猿了；第三，需求又改了！",
	"31": "一同事最近bug特别多，假装关切问他有多少个bug，他回答：10。过几日，再问，他回答：10。我：“这么多天过去了，怎么一点变化都没有？”，他：”哪里没有变化啊，以前是十进制，现在变成十六进制。",
	"75": "据说一老外年轻的时候，立志要当一名伟大的作家。怎么才算伟大呢？他说：我写的东西全世界都要看到！看完他们必定会歇斯底里！会火冒三丈！会痛苦万分！结果，他成功了，他在微软公司负责写系统蓝屏时的报错提示信息。。。",
	"32": "我很奇怪客栈这个词。难道后入住的必须先退房吗？",
	"76": "啥叫职业病？职业病就是作为一个挨踢民工，如果有一天5点钟就下班，你会很无比内疚；如果连续两天5点下班，你会无比自责；如果连续三天5点下班，你会严重怀疑公司是不是准备把你给炒了。",
	"33": "假如生活欺骗了你，找50个程序员问问为什么编程；假如生活让你想死，找50个程序员问问BUG改完了没有；假如你觉得生活拮据，找50个程序员问问工资涨了没有；假如你觉得活着无聊，找50个程序员问问他们一天都干了什么！",
	"77": "据说，程序员们敲键盘时，发现只有两只大拇指比较闲，可以用来扳着计算，所以采用了二进制。",
	"34": "话说，决定一个程序员跳槽与否的关键因素是他前同事的现工资~",
	"78": "某日和同学聊起对象问题，我答道：哥最不缺的就是对象了，要知道哥是程序员，每天不知道要new多少个对象出来，而且想要啥类型就有啥类型。如果你想要，哥给你来个for循环嵌套，new上她千个百个。",
	"35": "程序员最憋屈的事情就是：你辛辛苦苦熬夜写了一个风格优雅的源文件，被一个代码风格极差的同事改了且没署名，以至于别人都以为你是写的。。。",
	"79": "做为一名程序员，我每次看到工资单的时候，都会想：那些数字为神马不是16进制。",
	"36": "昨天晚上做梦梦见我得到了九阴真经的武功秘籍，打开第一页一看，我X，赫然写着口诀“hello world！”",
	"37": "前端工程师说，我去交友网站找女朋友去了。朋友问，找到了么？工程师说，找到了他们页面的一个bug……",
	"38": "十年生死两茫茫，百度兴，谷歌亡。微博火，推特无处话凄凉。纵使相逢应不识，MSN死，微信狂。人人佳缘喜还乡，京东刘，泡妞强。淘宝在，海淘忙。视频互相打，论坛靠色狼，陌陌帮上床。聊到马云断肠处，余额宝，怕是活不长。",
	"39": "程序员被叫去修电脑，正确的回答方式是：『哦，不好意思啊，我是一个程序员，我并不会修电脑，我其实只会把电脑搞出问题来，老实说，你电脑上的这些问题都是我们程序员搞出来的』",
	"80": "c程序员看不起c++程序员， c++程序员看不起java程序员， java程序员看不起c#程序员，c#程序员看不起美工， 周末了，美工带着妹子出去约会了…一群SX程序员还在加班！",
	"81": "程序员都是好男人，因为他们一整天都在扪心自问：我到底错在哪了，让我知道，我一定改…",
	"82": "某游戏公司招了个日本人当主策，上班第一天就对下属说：“我是个加班狂，希望大家配合我。”一个月之后他回日本了，最后一句话是：“你们这样加班是不人道的。”",
	"83": "程序员应聘必备词汇：了解＝听过名字；熟悉＝知道是啥；熟练＝用过；精通＝做过东西。",
	"40": "时至今日都是我咎由自取，找不到对象就是找不到对象，与任何人无关。程序员生涯的苦文明用语，造就了我娇羞内向，不问红尘的脾气，导致今日岌岌可危的地步，我今天愿意承担一切后果。其实，我很感谢你们让我跌倒在今天，而不是在我依旧文明用语丝的将来，我必须重新梳理自己，坦然面对并修复bug！本码农，生活中写就了一段满是bug的代码，我辜负了老板和老板的老板",
	"84": "两程序员聊天，程序员甲抱怨:做程序员太辛苦了，我想换行……我该怎么办？程序员乙:敲一下回车。",
	"41": "我应聘了一个大型IT公司的\"网络攻击研究部经理\" 职务, 面试官问我: 你觉得自己为什么适合这份工作? 我: 我黑进你们的系统, 给我自己发了面试通知.",
	"85": "【程序员每日安排】 do { write_code(); eat(); sleep(); }",
	"42": "老婆让我教她编程，想看看网页是怎么做的，于是我教她用JQuery, PHP 做些简单的小程序。在动手写出些Hello World的小程序后，老婆说：“编程也不是很难嘛，但是你们这些程序员太装逼了，无论前端还是后端的程序，代码里到处都是“$”，你们是想钱想疯了是吧？",
	"43": "有个学生在人人发状态：“找不到对象找不到对象找不到对象找不到对象找不到对象”。我回复：“请确定该对象存在，并正确拼写其名称和路径名”。另一个学生回复：“真的无法获取对象就去声明一个基类吧！"
}